Family Property
 The Family object to which the symbol belongs.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Family Family { get; }
  Visual Basic
Public ReadOnly Property Family As Family
	Get
  Visual C++
public:
property Family^ Family {
	Family^ get ();
}
 See Also
  FamilySymbol Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →